Repository: Jeff-Tian/my-body
Catalog: MyBody/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: 该报告未保存原始照片，无法重新识别。可改用“编辑”手动修正数值。
en: This report has no saved original photo, so it can't be re-recognized. Use Edit to correct the values manually.

source: 写入健康
en: Write to Health

source: 将体重历史写入「健康」App
en: Write weight history to the Health app

source: 选择范围
en: Choose Range

source: 全部历史
en: All History

source: 当前图表范围
en: Current Chart Range

source: 最近 30 天
en: Last 30 Days

source: 取消
en: Cancel

source: 正在写入...
en: Writing…

source: 写入完成
en: Write Complete

source: 已写入 %lld 条
en: Wrote %lld samples

source: 已跳过 %lld 条 (重复)
en: Skipped %lld (duplicates)

source: 已跳过 %lld 条 (无效)
en: Skipped %lld (invalid)

source: 失败 %lld 条
en: Failed %lld

source: 查看失败详情
en: Show Failed Details

source: 好
en: OK

source: 需要健康权限
en: Health Permission Needed

source: 打开设置
en: Open Settings

source: 失败详情
en: Failed Details

source: 完成
en: Done
